# StairsLandingType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsLandingType Class
Members See Also
---
Represents a stairs landing type in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class StairsLandingType : ElementType
```

Visual Basic
---
```text
Public Class StairsLandingType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class StairsLandingType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Architecture..::..StairsLandingType
# See Also
StairsLandingType Members
Autodesk.Revit.DB.Architecture Namespace